; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v12)
             (pred_1 ?v6 ?v8)
             (pred_10 ?v1 ?v8)
             (pred_2 ?v9 ?v1 )
	     (pred_8 ?v1)
             (pred_4 ?v11)
             (pred_5 ?v6)
             (pred_9 ?v8)
             (pred_3 ?v1)
             (pred_6 ?v6)
             (pred_11 ?v1)
             (pred_12 ))



(:action op_4
:parameters (?v13 ?v4 ?v3 ?v5)
:precondition (and (pred_4 ?v13) (pred_4 ?v4) (pred_5 ?v3) (pred_9 ?v5)
          (pred_7 ?v13 ?v4) (pred_1 ?v3 ?v5)
                   (pred_10 ?v4 ?v5) (pred_8 ?v13) 
                   (pred_3 ?v4) (pred_6 ?v3))
:effect (and  (pred_11 ?v4) (not (pred_3 ?v4))))


(:action op_3
:parameters (?v13 ?v10)
:precondition (and (pred_4 ?v13) (pred_4 ?v10)
               (pred_8 ?v13) (pred_7 ?v13 ?v10) (pred_11 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v13))))

(:action op_2
:parameters (?v13 ?v3)
:precondition (and (pred_4 ?v13) (pred_5 ?v3) 
                  (pred_8 ?v13) (pred_2 ?v3 ?v13) (pred_12 ))
:effect (and (pred_6 ?v3)
   (not (pred_2 ?v3 ?v13)) (not (pred_12 ))))


(:action op_5
:parameters (?v13 ?v2 ?v7)
:precondition (and (pred_4 ?v13) (pred_5 ?v2) (pred_5 ?v7)
                  (pred_8 ?v13) (pred_6 ?v7) (pred_2 ?v2 ?v13))
:effect (and (pred_6 ?v2) (pred_2 ?v7 ?v13)
        (not (pred_6 ?v7)) (not (pred_2 ?v2 ?v13))))

(:action op_1
:parameters (?v13 ?v3)
:precondition (and (pred_4 ?v13) (pred_5 ?v3) 
                  (pred_8 ?v13) (pred_6 ?v3))
:effect (and (pred_12 ) (pred_2 ?v3 ?v13) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_03 obj_18 obj_17 obj_05 obj_23 obj_28 obj_01 obj_22 obj_16 obj_30 obj_11 obj_31 obj_08 obj_10 obj_13 obj_15 obj_32 obj_26 obj_04 obj_24 obj_12 obj_09 obj_07 obj_21 obj_06
    obj_02 obj_19 obj_29
    obj_14 obj_20 obj_27 obj_25
    )

    (:init
       (pred_12)

       (pred_4 obj_03)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_05)
       (pred_4 obj_23)
       (pred_4 obj_28)
       (pred_4 obj_01)
       (pred_4 obj_22)
       (pred_4 obj_16)
       (pred_4 obj_30)
       (pred_4 obj_11)
       (pred_4 obj_31)
       (pred_4 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_32)
       (pred_4 obj_26)
       (pred_4 obj_04)
       (pred_4 obj_24)
       (pred_4 obj_12)
       (pred_4 obj_09)
       (pred_4 obj_07)
       (pred_4 obj_21)
       (pred_4 obj_06)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_27)
       (pred_5 obj_25)

       (pred_7 obj_03 obj_28)
       (pred_7 obj_03 obj_18)
       (pred_7 obj_18 obj_01)
       (pred_7 obj_18 obj_17)
       (pred_7 obj_18 obj_03)
       (pred_7 obj_17 obj_22)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_18)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_05 obj_23)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_23 obj_30)
       (pred_7 obj_23 obj_05)
       (pred_7 obj_28 obj_11)
       (pred_7 obj_28 obj_01)
       (pred_7 obj_28 obj_03)
       (pred_7 obj_01 obj_31)
       (pred_7 obj_01 obj_22)
       (pred_7 obj_01 obj_18)
       (pred_7 obj_01 obj_28)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_22 obj_17)
       (pred_7 obj_22 obj_01)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_16 obj_30)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_30 obj_13)
       (pred_7 obj_30 obj_23)
       (pred_7 obj_30 obj_16)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_11 obj_31)
       (pred_7 obj_11 obj_28)
       (pred_7 obj_31 obj_32)
       (pred_7 obj_31 obj_08)
       (pred_7 obj_31 obj_01)
       (pred_7 obj_31 obj_11)
       (pred_7 obj_08 obj_26)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_08 obj_31)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_13)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_13 obj_24)
       (pred_7 obj_13 obj_30)
       (pred_7 obj_13 obj_10)
       (pred_7 obj_15 obj_12)
       (pred_7 obj_15 obj_32)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_32 obj_09)
       (pred_7 obj_32 obj_26)
       (pred_7 obj_32 obj_31)
       (pred_7 obj_32 obj_15)
       (pred_7 obj_26 obj_07)
       (pred_7 obj_26 obj_04)
       (pred_7 obj_26 obj_08)
       (pred_7 obj_26 obj_32)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_24)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_04 obj_26)
       (pred_7 obj_24 obj_06)
       (pred_7 obj_24 obj_13)
       (pred_7 obj_24 obj_04)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_15)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_32)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_26)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_21 obj_06)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_06 obj_24)
       (pred_7 obj_06 obj_21)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_28)
       (pred_3 obj_08)
       (pred_10  obj_18 obj_02)
       (pred_10  obj_01 obj_19)
       (pred_10  obj_28 obj_29)
       (pred_10  obj_08 obj_02)
       (pred_11 obj_03)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_23)
       (pred_11 obj_22)
       (pred_11 obj_16)
       (pred_11 obj_30)
       (pred_11 obj_11)
       (pred_11 obj_31)
       (pred_11 obj_10)
       (pred_11 obj_13)
       (pred_11 obj_15)
       (pred_11 obj_32)
       (pred_11 obj_26)
       (pred_11 obj_04)
       (pred_11 obj_24)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_07)
       (pred_11 obj_21)
       (pred_11 obj_06)

       (pred_1  obj_14 obj_02)
       (pred_1  obj_20 obj_19)
       (pred_1  obj_27 obj_29)
       (pred_1  obj_25 obj_02)
       (pred_2 obj_14 obj_15)
       (pred_2 obj_20 obj_30)
       (pred_2 obj_27 obj_06)
       (pred_2 obj_25 obj_12)
       (pred_8 obj_23)
    )

    (:goal (and
       (pred_2 obj_20 obj_11)
       (pred_2 obj_25 obj_07)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_3 obj_23 obj_30)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_30)
   goals met: 0 of 2
2. (op_2 obj_30 obj_20)
   deleted: (pred_2 obj_20 obj_30) (pred_12)
   added: (pred_6 obj_20)
   goals met: 0 of 2
3. (op_3 obj_30 obj_16)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_16)
   goals met: 0 of 2
4. (op_3 obj_16 obj_10)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_10)
   goals met: 0 of 2
5. (op_3 obj_10 obj_04)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_04)
   goals met: 0 of 2
6. (op_3 obj_04 obj_26)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_26)
   goals met: 0 of 2
7. (op_3 obj_26 obj_07)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_07)
   goals met: 0 of 2
8. (op_1 obj_07 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_12) (pred_2 obj_20 obj_07)
   goals met: 0 of 2
9. (op_3 obj_07 obj_26)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_26)
   goals met: 0 of 2
10. (op_3 obj_26 obj_32)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_32)
   goals met: 0 of 2
11. (op_3 obj_32 obj_15)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_15)
   goals met: 0 of 2
12. (op_2 obj_15 obj_14)
   deleted: (pred_2 obj_14 obj_15) (pred_12)
   added: (pred_6 obj_14)
   goals met: 0 of 2
13. (op_3 obj_15 obj_11)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_11)
   goals met: 0 of 2
14. (op_1 obj_11 obj_14)
   deleted: (pred_6 obj_14)
   added: (pred_12) (pred_2 obj_14 obj_11)
   goals met: 0 of 2
15. (op_3 obj_11 obj_15)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_15)
   goals met: 0 of 2
16. (op_3 obj_15 obj_12)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_12)
   goals met: 0 of 2
17. (op_2 obj_12 obj_25)
   deleted: (pred_2 obj_25 obj_12) (pred_12)
   added: (pred_6 obj_25)
   goals met: 0 of 2
18. (op_3 obj_12 obj_15)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_15)
   goals met: 0 of 2
19. (op_3 obj_15 obj_32)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_32)
   goals met: 0 of 2
20. (op_3 obj_32 obj_26)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_26)
   goals met: 0 of 2
21. (op_3 obj_26 obj_07)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_07)
   goals met: 0 of 2
22. (op_5 obj_07 obj_20 obj_25)
   deleted: (pred_6 obj_25) (pred_2 obj_20 obj_07)
   added: (pred_6 obj_20) (pred_2 obj_25 obj_07)
   goals met: 1 of 2
23. (op_3 obj_07 obj_26)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_26)
   goals met: 1 of 2
24. (op_3 obj_26 obj_32)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_32)
   goals met: 1 of 2
25. (op_3 obj_32 obj_31)
   deleted: (pred_8 obj_32)
   added: (pred_8 obj_31)
   goals met: 1 of 2
26. (op_3 obj_31 obj_11)
   deleted: (pred_8 obj_31)
   added: (pred_8 obj_11)
   goals met: 1 of 2
27. (op_5 obj_11 obj_14 obj_20)
   deleted: (pred_6 obj_20) (pred_2 obj_14 obj_11)
   added: (pred_6 obj_14) (pred_2 obj_20 obj_11)
   goals met: 2 of 2
